Tekla Open API Reference for Tekla Structures 2025
AnalysisPartCompositeProperties.CompositeBeamSlabThickness Property
 The composite beam slab thickness.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double CompositeBeamSlabThickness { get; set; }
Public Property CompositeBeamSlabThickness As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
AnalysisPartCompositeProperties Class
Tekla.Structures.Analysis Namespace